app/controllers/api/quotes_controller.rb

  def create
    data = JSON.parse(request.body.read)
    last_id = Quote.last.id
    @quote = Quote.create(author: data["author"], text: data["text"], id: (last_id + 1))
---
SELECT  "quotes".* FROM "quotes" ORDER BY "quotes"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "quotes" ("id", "text", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 6], ["text", "A reader lives a thousands lives before he dies"], ["author", "Jojen Reed"], ["created_at", "2017-10-04 18:46:48.292308"], ["updated_at", "2017-10-04 18:46:48.292308"]]