app/controllers/pages_controller.rb

SELECT  "quotes".* FROM "quotes" ORDER BY "quotes"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @first_quote_id = Quote.first.id